app/views/quizzes/_form.html.erb

SELECT "animals".* FROM "animals"
---
  <tbody>
    <!--<% @animals = Animal.all %>