app/controllers/animals_controller.rb

INSERT INTO "animals" ("created_at", "image", "name", "sound", "updated_at") VALUES (?, ?, ?, ?, ?)  [["created_at", Sat, 25 Jan 2014 19:29:51 UTC +00:00], ["image", "img_orso"], ["name", "orso"], ["sound", "verso_orso"], ["updated_at", Sat, 25 Jan 2014 19:29:51 UTC +00:00]]
---
  def create
    @animal = Animal.new(animal_params)


    respond_to do |format|
      if @animal.save

UPDATE "animals" SET "avatar_file_name" = ?, "avatar_content_type" = ?, "avatar_file_size" = ?, "avatar_updated_at" = ?, "updated_at" = ? WHERE "animals"."id" = 2
---
  def update
    respond_to do |format|
      if @animal.update(animal_params)

DELETE FROM "animals" WHERE "animals"."id" = ?  [["id", 1]]
---
  def destroy
    # we also need to destroy quizzes associated to this animal, if any
    @quiz=Quiz.where(animal_id: @animal.id)
    @quiz2=Quiz.where(alternative_id:  @animal.id)
    @quiz.each do |q|
      q.destroy
    end
    @quiz2.each do |p|
      p.destroy
    end
    @animal.destroy

SELECT "animals".* FROM "animals" WHERE "animals"."id" = ? LIMIT 1  [["id", "3"]]
---
    def set_animal
      @animal = Animal.find(params[:id])