app/controllers/users_controller.rb

UPDATE "users" SET "username" = ?, "encrypted_password" = ?, "updated_at" = ? WHERE "users"."id" = 1  [["username", "Ventu"], ["encrypted_password", "$2a$10$MAm4smYJhf9dJwvRqmdl.e0XOtYLy1DEBJ/6f4UNDIvNvNmpp6hgK"], ["updated_at", Wed, 22 Jan 2014 23:16:47 UTC +00:00]]
---
  def update
# params[:user].delete(:password) if params[:user][:password].blank?
 #params[:user].delete(:password_confirmation) if params[:user][:password].blank? and params[:user][:password_confirmation].blank?
  params[:user][:password] = @user.password if params[:user][:password].blank?
  params[:user][:password_confirmation] = @user.password if params[:user][:password_confirmation].blank?
  params[:user][:username] = @user.username if params[:user][:username].blank?

# if @user.update_attributes(params[:user])


    respond_to do |format|
     if @user.update(user_params)